espruino/Espruino/targets/stm32/jshardware.c
/*
 * jshardware.c
 *
 *  Created on: 8 Aug 2012
 *      Author: gw
 */

#if USB
 #ifdef STM32F1
  #include "usb_utils.h"
  #include "usb_lib.h"
  #include "usb_conf.h"
  #include "usb_pwr.h"
 #endif
#endif

#include "jshardware.h"
#include "jsutils.h"
#include "jsparse.h"
#include "jsinteractive.h"


 #if defined(STM32F4)
  #define ADDR_FLASH_SECTOR_11    ((uint32_t)0x080E0000) /* Base @ of Sector 11, 128 Kbytes */
  #define FLASH_MEMORY_SIZE (1024*1024)
  #define FLASH_PAGE_SIZE (128*1024)
  #define FLASH_PAGES 1
 #elif defined(OLIMEXINO_STM32)
  #define FLASH_MEMORY_SIZE (128*1024)
  #define FLASH_PAGE_SIZE 1024
  #define FLASH_PAGES 14
 #else
  #define FLASH_MEMORY_SIZE (128*1024)
  #define FLASH_PAGE_SIZE 1024
  #define FLASH_PAGES 6
 #endif

#define FLASH_LENGTH (FLASH_PAGE_SIZE*FLASH_PAGES)
#if FLASH_LENGTH < 8+JSVAR_CACHE_SIZE*20
#error NOT ENOUGH ROOM IN FLASH - UNLESS WE ARE ONLY USING 16 bytes forJsVarRef ? FLASH_PAGES pages at FLASH_PAGE_SIZE bytes
#endif

#define FLASH_START (0x08000000 + FLASH_MEMORY_SIZE - FLASH_LENGTH)
#define FLASH_MAGIC_LOCATION (FLASH_START+FLASH_LENGTH-8)
#define FLASH_MAGIC 0xDEADBEEF

// ----------------------------------------------------------------------------
//                                                                        PINS
typedef struct IOPin {
  uint16_t pin;      // GPIO_Pin_1
  GPIO_TypeDef *gpio; // GPIOA
  uint8_t adc; // 0xFF or ADC_Channel_1
  /* timer - bits 0-1 = channel
             bits 2-5 = timer (NOTE - so only 0-15!)
             bit 6    = remap - for F1 part crazy stuff
             bit 7    = negated */
  uint8_t timer;
} PACKED_FLAGS IOPin;

#define TIMER(TIM,CH) (TIM<<2)|(CH-1)
#define TIMERN(TIM,CH) (TIM<<2)|(CH-1)|0x80
#define TIMNONE 0
#define TIMREMAP 64
#define TIMER_REMAP(X) ((X)&64)
#define TIMER_CH(X) (((X)&3)+1)
#define TIMER_TMR(X) (((X)>>2)&15)
#define TIMER_NEG(X) (((X)>>7)&1)

#ifdef STM32F4
 #define IOPINS 82 // 16*5+2
 // some of these use the same timer!
 const IOPin IOPIN_DATA[IOPINS] = {
 { GPIO_Pin_0,  GPIOA, ADC_Channel_0, TIMER(5,1) },
 { GPIO_Pin_1,  GPIOA, ADC_Channel_1, TIMER(5,2) },
 { GPIO_Pin_2,  0, 0xFF, TIMNONE },//A2 - Serial
 { GPIO_Pin_3,  0, 0xFF, TIMNONE },//A3 - Serial
 { GPIO_Pin_4,  GPIOA, ADC_Channel_4, TIMNONE },
 { GPIO_Pin_5,  GPIOA, ADC_Channel_5, TIMNONE },
 { GPIO_Pin_6,  GPIOA, ADC_Channel_6, TIMER(13,1) }, //+ TIMER(3,1)
 { GPIO_Pin_7,  GPIOA, ADC_Channel_7, TIMER(14,1) }, //+ TIMERN(8,1) + TIMER(3,2) + TIMERN(1,1)
 { GPIO_Pin_8,  GPIOA, 0xFF, TIMER(1,1) },
 { GPIO_Pin_9,  GPIOA, 0xFF, TIMER(1,2) }, 
 { GPIO_Pin_10, GPIOA, 0xFF, TIMER(1,3) }, 
 { GPIO_Pin_11, GPIOA, 0xFF, TIMER(1,4) },
 { GPIO_Pin_12, GPIOA, 0xFF, TIMNONE },
 { GPIO_Pin_13, GPIOA, 0xFF, TIMNONE },
 { GPIO_Pin_14, GPIOA, 0xFF, TIMNONE },
 { GPIO_Pin_15, GPIOA, 0xFF, TIMNONE },

 { GPIO_Pin_0,  GPIOB, ADC_Channel_8, TIMER(3,3) }, //+ TIMERN(8,2) + TIMERN(1,2)
 { GPIO_Pin_1,  GPIOB, ADC_Channel_9, TIMER(3,4) }, //+ TIMERN(8,3) + TIMERN(1,3)
 { GPIO_Pin_2,  GPIOB, 0xFF, TIMNONE },
 { GPIO_Pin_3,  GPIOB, 0xFF, TIMER(2,2) },
 { GPIO_Pin_4,  GPIOB, 0xFF, TIMER(3,1) },
 { GPIO_Pin_5,  GPIOB, 0xFF, TIMER(3,2) },
 { GPIO_Pin_6,  GPIOB, 0xFF, TIMER(4,1) },
 { GPIO_Pin_7,  GPIOB, 0xFF, TIMER(4,2) },
 { GPIO_Pin_8,  GPIOB, 0xFF, TIMER(4,3) }, //+TIMER(10,1)
 { GPIO_Pin_9,  GPIOB, 0xFF, TIMER(4,4) }, //+TIMER(11,1)
 { GPIO_Pin_10, GPIOB, 0xFF, TIMER(2,3) },
 { GPIO_Pin_11, GPIOB, 0xFF, TIMER(2,4) },
 { GPIO_Pin_12, GPIOB, 0xFF, TIMNONE },
 { GPIO_Pin_13, GPIOB, 0xFF, TIMERN(1,1) },
 { GPIO_Pin_14, GPIOB, 0xFF, TIMER(12,1) }, //+TIMERN(1,2)+TIMERN(8,2)
 { GPIO_Pin_15, GPIOB, 0xFF, TIMER(12,2) }, //+TIMERN(1,3)+TIMERN(8,3)

 { GPIO_Pin_0,  GPIOC, ADC_Channel_10, TIMNONE },
 { GPIO_Pin_1,  GPIOC, ADC_Channel_11, TIMNONE },
 { GPIO_Pin_2,  GPIOC, ADC_Channel_12, TIMNONE },
 { GPIO_Pin_3,  GPIOC, ADC_Channel_13, TIMNONE },
 { GPIO_Pin_4,  GPIOC, ADC_Channel_14, TIMNONE },
 { GPIO_Pin_5,  GPIOC, ADC_Channel_15, TIMNONE },
 { GPIO_Pin_6,  GPIOC, 0xFF, TIMER(8,1) }, //+, TIMER(3,1)
 { GPIO_Pin_7,  GPIOC, 0xFF, TIMER(8,2) },//+, TIMER(3,2)
 { GPIO_Pin_8,  GPIOC, 0xFF, TIMER(8,3) },//+, TIMER(3,3)
 { GPIO_Pin_9,  GPIOC, 0xFF, TIMER(8,4) }, //+, TIMER(3,4)
 { GPIO_Pin_10, GPIOC, 0xFF, TIMNONE },
 { GPIO_Pin_11, GPIOC, 0xFF, TIMNONE },
 { GPIO_Pin_12, GPIOC, 0xFF, TIMNONE },
 { GPIO_Pin_13, GPIOC, 0xFF, TIMNONE },
 { GPIO_Pin_14, GPIOC, 0xFF, TIMNONE },
 { GPIO_Pin_15, GPIOC, 0xFF, TIMNONE },

 { GPIO_Pin_0,  GPIOD, 0xFF, TIMNONE },
 { GPIO_Pin_1,  GPIOD, 0xFF, TIMNONE },
 { GPIO_Pin_2,  GPIOD, 0xFF, TIMNONE },
 { GPIO_Pin_3,  GPIOD, 0xFF, TIMNONE },
 { GPIO_Pin_4,  GPIOD, 0xFF, TIMNONE },
 { GPIO_Pin_5,  GPIOD, 0xFF, TIMNONE },
 { GPIO_Pin_6,  GPIOD, 0xFF, TIMNONE },
 { GPIO_Pin_7,  GPIOD, 0xFF, TIMNONE },
 { GPIO_Pin_8,  GPIOD, 0xFF, TIMNONE },
 { GPIO_Pin_9,  GPIOD, 0xFF, TIMNONE },
 { GPIO_Pin_10, GPIOD, 0xFF, TIMNONE },
 { GPIO_Pin_11, GPIOD, 0xFF, TIMNONE },
 { GPIO_Pin_12, GPIOD, 0xFF, TIMER(4,1) },
 { GPIO_Pin_13, GPIOD, 0xFF, TIMER(4,2) },
 { GPIO_Pin_14, GPIOD, 0xFF, TIMER(4,3) },
 { GPIO_Pin_15, GPIOD, 0xFF, TIMER(4,4) },

 { GPIO_Pin_0,  GPIOE, 0xFF },
 { GPIO_Pin_1,  GPIOE, 0xFF },
 { GPIO_Pin_2,  GPIOE, 0xFF },
 { GPIO_Pin_3,  GPIOE, 0xFF },
 { GPIO_Pin_4,  GPIOE, 0xFF },
 { GPIO_Pin_5,  GPIOE, 0xFF, TIMER(9,1) },
 { GPIO_Pin_6,  GPIOE, 0xFF, TIMER(9,2) },
 { GPIO_Pin_7,  GPIOE, 0xFF },
 { GPIO_Pin_8,  GPIOE, 0xFF, TIMERN(1,1) },
 { GPIO_Pin_9,  GPIOE, 0xFF, TIMER(1,1) },
 { GPIO_Pin_10, GPIOE, 0xFF, TIMERN(1,2) },
 { GPIO_Pin_11, GPIOE, 0xFF, TIMER(1,2) },
 { GPIO_Pin_12, GPIOE, 0xFF, TIMERN(1,3) },
 { GPIO_Pin_13, GPIOE, 0xFF, TIMER(1,3) },
 { GPIO_Pin_14, GPIOE, 0xFF, TIMER(1,4) },
 { GPIO_Pin_15, GPIOE, 0xFF },

 { GPIO_Pin_0,  GPIOH, 0xFF },
 { GPIO_Pin_1,  GPIOH, 0xFF },
};
#else
#if OLIMEXINO_STM32
#define IOPINS 39 // 16*3+2
const IOPin IOPIN_DATA[IOPINS] = {
    // A0-A5 are hared with D15-D20
#define A0_OFFSET 15
    // D0
{ GPIO_Pin_3,  GPIOA, ADC_Channel_3, TIMER(2,4) }, //, TIMER(15,2)
{ GPIO_Pin_2,  GPIOA, ADC_Channel_2, TIMER(2,3) }, // , TIMER(15,1)
{ GPIO_Pin_0,  GPIOA, ADC_Channel_0, TIMNONE },
{ GPIO_Pin_1,  GPIOA, ADC_Channel_1, TIMER(2,2) },
    // D4
{ GPIO_Pin_5,  GPIOB, 0xFF, TIMER(3,2)|TIMREMAP },
{ GPIO_Pin_6,  GPIOB, 0xFF, TIMER(4,1) },
{ GPIO_Pin_8,  GPIOA, 0xFF, TIMER(1,1) },
{ GPIO_Pin_9,  GPIOA, 0xFF, TIMER(1,2) }, // A9 - Serial
    // D8
{ GPIO_Pin_10, GPIOA, 0xFF, TIMER(1,3) }, // A10 - Serial
{ GPIO_Pin_7,  GPIOB, 0xFF, TIMER(4,2) },
{ GPIO_Pin_4,  GPIOA, ADC_Channel_4, TIMNONE },
{ GPIO_Pin_7,  GPIOA, ADC_Channel_7, TIMER(3,2) }, //, TIMER(17,1)
    // D12
{ GPIO_Pin_6,  GPIOA, ADC_Channel_6, TIMER(3,1) }, //, TIMER(16,1)
{ GPIO_Pin_5,  GPIOA, ADC_Channel_5, TIMNONE },
{ GPIO_Pin_8,  GPIOB, 0xFF, TIMER(4,3) }, //, TIMER(16,1)
    // D15-20 shared with A0-15
{ GPIO_Pin_0,  GPIOC, ADC_Channel_10, TIMNONE  },
{ GPIO_Pin_1,  GPIOC, ADC_Channel_11, TIMNONE  },
{ GPIO_Pin_2,  GPIOC, ADC_Channel_12, TIMNONE  },
{ GPIO_Pin_3,  GPIOC, ADC_Channel_13, TIMNONE  },
{ GPIO_Pin_4,  GPIOC, ADC_Channel_14, TIMNONE  },
{ GPIO_Pin_5,  GPIOC, ADC_Channel_15, TIMNONE  },
    // D21
{ GPIO_Pin_13, GPIOC, 0xFF, TIMNONE/*?*/ },
{ GPIO_Pin_14, GPIOC, 0xFF, TIMNONE/*?*/ },
{ GPIO_Pin_15, GPIOC, 0xFF, TIMNONE/*?*/ },
    // D24
{ GPIO_Pin_9,  GPIOB, 0xFF, TIMER(4,4) }, //, TIMER(17,1)
{ GPIO_Pin_2,  GPIOD, 0xFF, TIMNONE/*?*/ },
{ GPIO_Pin_10, GPIOC, 0xFF, TIMNONE },
{ GPIO_Pin_0,  GPIOB, ADC_Channel_8, TIMER(3,3) }, // , TIMERN(1,2)
    // D28
{ GPIO_Pin_1,  GPIOB, ADC_Channel_9, TIMER(3,4) }, // , TIMER(1,3)
{ GPIO_Pin_10, GPIOB, 0xFF, TIMER(2,3) },
{ GPIO_Pin_11, GPIOB, 0xFF, TIMER(2,4)|TIMREMAP },
{ GPIO_Pin_12, GPIOB, 0xFF, TIMNONE },
    // D32
{ GPIO_Pin_13, GPIOB, 0xFF, TIMERN(1,1) },
{ GPIO_Pin_14, GPIOB, 0xFF, TIMER(15,1)|TIMREMAP },// , TIMERN(1,2)
{ GPIO_Pin_15, GPIOB, 0xFF, TIMER(15,2)|TIMREMAP },// , TIMERN(1,3), TIMERN(15,1)
{ GPIO_Pin_6,  GPIOC, 0xFF, TIMER(3,1)|TIMREMAP },
   // D36
{ GPIO_Pin_7,  GPIOC, 0xFF, TIMER(3,2)|TIMREMAP },
{ GPIO_Pin_8,  GPIOC, 0xFF, TIMER(3,3)|TIMREMAP },
   // 38 - the index of the button
{ GPIO_Pin_9,  GPIOC, 0xFF, TIMER(3,4)|TIMREMAP },
// D2 ?
};
#else
 // STM32VLDISCOVERY
 #define IOPINS 50 // 16*3+2
 const IOPin IOPIN_DATA[IOPINS] = {
 { GPIO_Pin_0,  GPIOA, ADC_Channel_0, TIMNONE },
 { GPIO_Pin_1,  GPIOA, ADC_Channel_1, TIMER(2,2) },
 { GPIO_Pin_2,  GPIOA, ADC_Channel_2, TIMER(2,3) }, // , TIMER(15,1)
 { GPIO_Pin_3,  GPIOA, ADC_Channel_3, TIMER(2,4) }, //, TIMER(15,2)
 { GPIO_Pin_4,  GPIOA, ADC_Channel_4, TIMNONE },
 { GPIO_Pin_5,  GPIOA, ADC_Channel_5, TIMNONE },
 { GPIO_Pin_6,  GPIOA, ADC_Channel_6, TIMER(3,1) }, //, TIMER(16,1)
 { GPIO_Pin_7,  GPIOA, ADC_Channel_7, TIMER(3,2) }, //, TIMER(17,1)
 { GPIO_Pin_8,  GPIOA, 0xFF, TIMER(1,1) },
 { GPIO_Pin_9,  0,     0xFF, TIMER(1,2) }, // A9 - Serial
 { GPIO_Pin_10, 0,     0xFF, TIMER(1,3) }, // A10 - Serial
 { GPIO_Pin_11, GPIOA, 0xFF, TIMER(1,4) },
 { GPIO_Pin_12, GPIOA, 0xFF, TIMNONE },
 { GPIO_Pin_13, GPIOA, 0xFF, TIMNONE },
 { GPIO_Pin_14, GPIOA, 0xFF, TIMNONE },
 { GPIO_Pin_15, GPIOA, 0xFF, TIMNONE },

