espruino/Espruino/targets/stm32/jshardware.c
 { GPIO_Pin_0,  GPIOB, ADC_Channel_8, TIMER(3,3) }, // , TIMERN(1,2)
 { GPIO_Pin_1,  GPIOB, ADC_Channel_9, TIMER(3,4) }, // , TIMER(1,3)
 { GPIO_Pin_2,  GPIOB, 0xFF, TIMNONE },
 { GPIO_Pin_3,  GPIOB, 0xFF, TIMER(2,2) },
 { GPIO_Pin_4,  GPIOB, 0xFF, TIMER(3,1)|TIMREMAP },
 { GPIO_Pin_5,  GPIOB, 0xFF, TIMER(3,2)|TIMREMAP },
 { GPIO_Pin_6,  GPIOB, 0xFF, TIMER(4,1) },
 { GPIO_Pin_7,  GPIOB, 0xFF, TIMER(4,2) },
 { GPIO_Pin_8,  GPIOB, 0xFF, TIMER(4,3) }, //, TIMER(16,1)
 { GPIO_Pin_9,  GPIOB, 0xFF, TIMER(4,4) }, //, TIMER(17,1)
 { GPIO_Pin_10, GPIOB, 0xFF, TIMER(2,3) },
 { GPIO_Pin_11, GPIOB, 0xFF, TIMER(2,4)|TIMREMAP },
 { GPIO_Pin_12, GPIOB, 0xFF, TIMNONE },
 { GPIO_Pin_13, GPIOB, 0xFF, TIMERN(1,1) },
 { GPIO_Pin_14, GPIOB, 0xFF, TIMER(15,1)|TIMREMAP },// , TIMERN(1,2)
 { GPIO_Pin_15, GPIOB, 0xFF, TIMER(15,2)|TIMREMAP },// , TIMERN(1,3), TIMERN(15,1)

 { GPIO_Pin_0,  GPIOC, ADC_Channel_10, TIMNONE  },
 { GPIO_Pin_1,  GPIOC, ADC_Channel_11, TIMNONE  },
 { GPIO_Pin_2,  GPIOC, ADC_Channel_12, TIMNONE  },
 { GPIO_Pin_3,  GPIOC, ADC_Channel_13, TIMNONE  },
 { GPIO_Pin_4,  GPIOC, ADC_Channel_14, TIMNONE  },
 { GPIO_Pin_5,  GPIOC, ADC_Channel_15, TIMNONE  },
 { GPIO_Pin_6,  GPIOC, 0xFF, TIMER(3,1)|TIMREMAP },
 { GPIO_Pin_7,  GPIOC, 0xFF, TIMER(3,2)|TIMREMAP },
 { GPIO_Pin_8,  GPIOC, 0xFF, TIMER(3,3)|TIMREMAP },
 { GPIO_Pin_9,  GPIOC, 0xFF, TIMER(3,4)|TIMREMAP },
 { GPIO_Pin_10, GPIOC, 0xFF, TIMNONE },
 { GPIO_Pin_11, GPIOC, 0xFF, TIMNONE },
 { GPIO_Pin_12, GPIOC, 0xFF, TIMNONE },
 { GPIO_Pin_13, GPIOC, 0xFF, TIMNONE/*?*/ },
 { GPIO_Pin_14, GPIOC, 0xFF, TIMNONE/*?*/ },
 { GPIO_Pin_15, GPIOC, 0xFF, TIMNONE/*?*/ },

 { GPIO_Pin_0,  GPIOD, 0xFF, TIMNONE/*?*/ },
 { GPIO_Pin_1,  GPIOD, 0xFF, TIMNONE/*?*/ }, 
 // D2 ?
};
#endif// OLIMEXINO_STM32
#endif

uint8_t pinToPinSource(uint16_t pin) {
  if (pin==GPIO_Pin_0 ) return GPIO_PinSource0;
  if (pin==GPIO_Pin_1 ) return GPIO_PinSource1;
  if (pin==GPIO_Pin_2 ) return GPIO_PinSource2;
  if (pin==GPIO_Pin_3 ) return GPIO_PinSource3;
  if (pin==GPIO_Pin_4 ) return GPIO_PinSource4;
  if (pin==GPIO_Pin_5 ) return GPIO_PinSource5;
  if (pin==GPIO_Pin_6 ) return GPIO_PinSource6;
  if (pin==GPIO_Pin_7 ) return GPIO_PinSource7;
  if (pin==GPIO_Pin_8 ) return GPIO_PinSource8;
  if (pin==GPIO_Pin_9 ) return GPIO_PinSource9;
  if (pin==GPIO_Pin_10) return GPIO_PinSource10;
  if (pin==GPIO_Pin_11) return GPIO_PinSource11;
  if (pin==GPIO_Pin_12) return GPIO_PinSource12;
  if (pin==GPIO_Pin_13) return GPIO_PinSource13;
  if (pin==GPIO_Pin_14) return GPIO_PinSource14;
  if (pin==GPIO_Pin_15) return GPIO_PinSource15;
  return GPIO_PinSource0;
}
uint8_t pinToEVEXTI(uint16_t pin) {
  if (pin==GPIO_Pin_0 ) return EV_EXTI0;
  if (pin==GPIO_Pin_1 ) return EV_EXTI1;
  if (pin==GPIO_Pin_2 ) return EV_EXTI2;
  if (pin==GPIO_Pin_3 ) return EV_EXTI3;
  if (pin==GPIO_Pin_4 ) return EV_EXTI4;
  if (pin==GPIO_Pin_5 ) return EV_EXTI5;
  if (pin==GPIO_Pin_6 ) return EV_EXTI6;
  if (pin==GPIO_Pin_7 ) return EV_EXTI7;
  if (pin==GPIO_Pin_8 ) return EV_EXTI8;
  if (pin==GPIO_Pin_9 ) return EV_EXTI9;
  if (pin==GPIO_Pin_10) return EV_EXTI10;
  if (pin==GPIO_Pin_11) return EV_EXTI11;
  if (pin==GPIO_Pin_12) return EV_EXTI12;
  if (pin==GPIO_Pin_13) return EV_EXTI13;
  if (pin==GPIO_Pin_14) return EV_EXTI14;
  if (pin==GPIO_Pin_15) return EV_EXTI15;
  return EV_NONE;
}
uint8_t portToPortSource(GPIO_TypeDef *port) {
 #ifdef STM32F4
  if (port == GPIOA) return EXTI_PortSourceGPIOA;
  if (port == GPIOB) return EXTI_PortSourceGPIOB;
  if (port == GPIOC) return EXTI_PortSourceGPIOC;
  if (port == GPIOD) return EXTI_PortSourceGPIOD;
  if (port == GPIOE) return EXTI_PortSourceGPIOE;
  if (port == GPIOF) return EXTI_PortSourceGPIOF;
  if (port == GPIOG) return EXTI_PortSourceGPIOG;
  if (port == GPIOH) return EXTI_PortSourceGPIOH;
  return EXTI_PortSourceGPIOA;
#else
  if (port == GPIOA) return GPIO_PortSourceGPIOA;
  if (port == GPIOB) return GPIO_PortSourceGPIOB;
  if (port == GPIOC) return GPIO_PortSourceGPIOC;
  if (port == GPIOD) return GPIO_PortSourceGPIOD;
  if (port == GPIOE) return GPIO_PortSourceGPIOE;
  if (port == GPIOF) return GPIO_PortSourceGPIOF;
  if (port == GPIOG) return GPIO_PortSourceGPIOG;
  return GPIO_PortSourceGPIOA;
#endif
}

// ----------------------------------------------------------------------------
JsSysTime SysTickMajor = SYSTICK_RANGE;

#ifdef USB
unsigned int SysTickUSBWatchdog = 0;
void jshKickUSBWatchdog() {
  SysTickUSBWatchdog = 0;
}
#endif //USB


void jshDoSysTick() {
  SysTickMajor+=SYSTICK_RANGE;
#ifdef USB
  if (SysTickUSBWatchdog < SYSTICKS_BEFORE_USB_DISCONNECT) {
    SysTickUSBWatchdog++;
  }
#endif //USB
}

// ----------------------------------------------------------------------------
void jshInit() {
  /* Enable UART and  GPIOx Clock */
 #ifdef STM32F4
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART2, ENABLE);
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_ADC1, ENABLE);
  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOA |
                         RCC_AHB1Periph_GPIOB |
                         RCC_AHB1Periph_GPIOC | 
                         RCC_AHB1Periph_GPIOD |
                         RCC_AHB1Periph_GPIOE |
                         RCC_AHB1Periph_GPIOF |
                         RCC_AHB1Periph_GPIOG |
                         RCC_AHB1Periph_GPIOH, ENABLE);
 #else
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_PWR, ENABLE);
  RCC_APB2PeriphClockCmd(
        RCC_APB2Periph_ADC1 |
        RCC_APB2Periph_GPIOA |
        RCC_APB2Periph_GPIOB |
        RCC_APB2Periph_GPIOC |
        RCC_APB2Periph_GPIOD |
        RCC_APB2Periph_AFIO, ENABLE);
 #endif
  // Slow the IO clocks down - we don't need them going so fast!
#ifdef STM32VLDISCOVERY
  RCC_PCLK1Config(RCC_HCLK_Div2); // PCLK1 must be >8 Mhz for USB to work
  RCC_PCLK2Config(RCC_HCLK_Div4);
#else
  RCC_PCLK1Config(RCC_HCLK_Div8); // PCLK1 must be >8 Mhz for USB to work
  RCC_PCLK2Config(RCC_HCLK_Div16);
#endif
  /* System Clock */
  SysTick_CLKSourceConfig(SysTick_CLKSource_HCLK_Div8);
  SysTick_Config(SYSTICK_RANGE-1); // 24 bit
  /* Initialise LEDs LD3&LD4, both on */
  GPIO_InitTypeDef GPIO_InitStructure;
#ifdef STM32F4
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStructure.GPIO_PuPd  = GPIO_PuPd_UP;
#else
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
#endif
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
#ifdef LED1_PORT
  GPIO_InitStructure.GPIO_Pin = LED1_PIN;  
  GPIO_Init(LED1_PORT, &GPIO_InitStructure);
#endif
#ifdef LED2_PORT
  GPIO_InitStructure.GPIO_Pin = LED2_PIN;  
  GPIO_Init(LED2_PORT, &GPIO_InitStructure);
#endif
#ifdef LED3_PORT
  GPIO_InitStructure.GPIO_Pin = LED3_PIN;  
  GPIO_Init(LED3_PORT, &GPIO_InitStructure);
#endif
#ifdef LED4_PORT
  GPIO_InitStructure.GPIO_Pin = LED4_PIN;  
  GPIO_Init(LED4_PORT, &GPIO_InitStructure);
#endif

