espruino/Espruino/targets/stm32/jshardware.c
#ifdef STM32F4
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN;
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
#else
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
#endif
#ifdef BTN_PORT  
  GPIO_InitStructure.GPIO_Pin = BTN_PIN;  
  GPIO_Init(BTN_PORT, &GPIO_InitStructure);
#endif
  GPIO_SetBits(LED1_PORT,LED1_PIN);

  if (DEFAULT_CONSOLE_DEVICE != EV_USBSERIAL)
    jshUSARTSetup(DEFAULT_CONSOLE_DEVICE, DEFAULT_BAUD_RATE);

  NVIC_InitTypeDef NVIC_InitStructure;
  /* Enable and set EXTI Line0 Interrupt to the lowest priority */
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0x01;
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0x01;
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  NVIC_InitStructure.NVIC_IRQChannel = EXTI0_IRQn;
  NVIC_Init(&NVIC_InitStructure);
  NVIC_InitStructure.NVIC_IRQChannel = EXTI1_IRQn;
  NVIC_Init(&NVIC_InitStructure);
  NVIC_InitStructure.NVIC_IRQChannel = EXTI2_IRQn;
  NVIC_Init(&NVIC_InitStructure);
  NVIC_InitStructure.NVIC_IRQChannel = EXTI3_IRQn;
  NVIC_Init(&NVIC_InitStructure);
  NVIC_InitStructure.NVIC_IRQChannel = EXTI4_IRQn;
  NVIC_Init(&NVIC_InitStructure);
  NVIC_InitStructure.NVIC_IRQChannel = EXTI9_5_IRQn;
  NVIC_Init(&NVIC_InitStructure);
  NVIC_InitStructure.NVIC_IRQChannel = EXTI15_10_IRQn;
  NVIC_Init(&NVIC_InitStructure);

#ifdef STM32F4
  ADC_CommonInitTypeDef ADC_CommonInitStructure;
  ADC_CommonStructInit(&ADC_CommonInitStructure);
  ADC_CommonInitStructure.ADC_Mode			= ADC_Mode_Independent;
  ADC_CommonInitStructure.ADC_Prescaler			= ADC_Prescaler_Div2;
  ADC_CommonInitStructure.ADC_DMAAccessMode		= ADC_DMAAccessMode_Disabled;
  ADC_CommonInitStructure.ADC_TwoSamplingDelay	        = ADC_TwoSamplingDelay_5Cycles;
  ADC_CommonInit(&ADC_CommonInitStructure);
#endif

  // ADC Structure Initialization
  ADC_InitTypeDef ADC_InitStructure;
  ADC_StructInit(&ADC_InitStructure);

  // Preinit
  ADC_InitStructure.ADC_ScanConvMode = DISABLE;
  ADC_InitStructure.ADC_ContinuousConvMode = DISABLE;
#ifdef STM32F4
  ADC_InitStructure.ADC_ExternalTrigConvEdge		= ADC_ExternalTrigConvEdge_None;
#else
  ADC_InitStructure.ADC_Mode = ADC_Mode_Independent;
  ADC_InitStructure.ADC_ExternalTrigConv = ADC_ExternalTrigConv_None;
  ADC_InitStructure.ADC_NbrOfChannel = 1;
#endif
  ADC_InitStructure.ADC_DataAlign = ADC_DataAlign_Left;
  ADC_Init(ADC1, &ADC_InitStructure);

  // Enable the ADC
  ADC_Cmd(ADC1, ENABLE);

#ifdef STM32F4
  // No calibration??
#else
  // Calibrate
  ADC_ResetCalibration(ADC1);
  while(ADC_GetResetCalibrationStatus(ADC1));
  ADC_StartCalibration(ADC1);
  while(ADC_GetCalibrationStatus(ADC1));
#endif

  jsiConsolePrintInt(SystemCoreClock/1000000);jsiConsolePrint(" Mhz\r\n");

  // Turn led off - so we know we have initialised
  GPIO_ResetBits(LED1_PORT,LED1_PIN);
}

void jshKill() {
}

void jshIdle() {
#ifdef USB
  static bool wasUSBConnected = false;
  bool USBConnected = jshIsUSBSERIALConnected();
  if (wasUSBConnected != USBConnected) {
    wasUSBConnected = USBConnected;
    if (USBConnected)
      jsiSetConsoleDevice(EV_USBSERIAL);
    else {
      jsiSetConsoleDevice(DEFAULT_CONSOLE_DEVICE);
      jshTransmitClearDevice(EV_USBSERIAL); // clear the transmit queue
    }
  }
#endif
}

// ----------------------------------------------------------------------------

bool jshIsUSBSERIALConnected() {
#ifdef USB
  return SysTickUSBWatchdog < SYSTICKS_BEFORE_USB_DISCONNECT;
  // not a check for connected - we just want to have some idea...
#else
  return false;
#endif
}

JsSysTime jshGetTimeFromMilliseconds(JsVarFloat ms) {
  return (JsSysTime)((ms*SystemCoreClock)/1000);
}

JsVarFloat jshGetMillisecondsFromTime(JsSysTime time) {
  return ((JsVarFloat)time)*1000/SystemCoreClock;
}


JsSysTime jshGetSystemTime() {
  JsSysTime t1 = SysTickMajor;
  JsSysTime time = (JsSysTime)SysTick->VAL;
  JsSysTime t2 = SysTickMajor;
  // times are different and systick has rolled over
  if (t1!=t2 && time > (SYSTICK_RANGE>>1)) 
    return t2 - time;
  return t1-time;
}

// ----------------------------------------------------------------------------

int jshGetPinFromString(const char *s) {
  // built in constants
#ifdef BTN_PININDEX
  if (s[0]=='B' && s[1]=='T' && s[2]=='N' && !s[3])
    return BTN_PININDEX;
#endif
#if defined(LED1_PININDEX) || defined(LED2_PININDEX) || defined(LED3_PININDEX) || defined(LED4_PININDEX)
  if (s[0]=='L' && s[1]=='E' && s[2]=='D') {
#ifdef LED1_PININDEX
    if (s[3]=='1' && !s[4]) return LED1_PININDEX;
#endif
#ifdef LED2_PININDEX
    if (s[3]=='2' && !s[4]) return LED2_PININDEX;
#endif
#ifdef LED3_PININDEX
    if (s[3]=='3' && !s[4]) return LED3_PININDEX;
#endif
#ifdef LED4_PININDEX
    if (s[3]=='4' && !s[4]) return LED4_PININDEX;
#endif
  }
#endif

#if defined(OLIMEXINO_STM32)
    // A0-A5 and D0-D37
    if (s[0]=='A' && s[1]) { // first 6 are analogs
      if (!s[2] && (s[1]>='0' && s[1]<='5'))
        return A0_OFFSET + (s[1]-'0');
    } else if (s[0]=='D' && s[1]) {
      if (!s[2] && (s[1]>='0' && s[1]<='9')) { // D0-D9
        return s[1]-'0';
      } else if (!s[3] && (s[1]>='1' && s[1]<='3' && s[2]>='0' && s[2]<='9')) { // D1X-D3X
        int n = (s[1]-'0')*10 + (s[2]-'0');
        if (n<38) return n;
      }
    }
#else // !OLIMEX
    if ((s[0]=='A' || s[0]=='B' || s[0]=='C' || s[0]=='D' || s[0]=='E' || s[0]=='H') && s[1]) { // first 6 are analogs
      int port = (s[0]=='H')?5:(s[0]-'A'); // GPIOH is strange because there is no F or G exposed!
      if (!s[2] && (s[1]>='0' && s[1]<='9')) { // D0-D9
        return (port*16) + (s[1]-'0');
      } else if (!s[3] && (s[1]>='1' && s[1]<='3' && s[2]>='0' && s[2]<='9')) { // D1X-D3X
        int n = (s[1]-'0')*10 + (s[2]-'0');
        int pin = (port*16)+n;
        if (pin<IOPINS) return pin;
      }
    }
#endif
  return -1;
}

bool jshPinInput(int pin) {
  bool value = false;
  if (pin>=0 && pin < IOPINS && IOPIN_DATA[pin].gpio) {
    GPIO_InitTypeDef GPIO_InitStructure;
    GPIO_InitStructure.GPIO_Pin = IOPIN_DATA[pin].pin;
#ifdef STM32F4    
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN;
    GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;    
#else
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
#endif
    GPIO_Init(IOPIN_DATA[pin].gpio, &GPIO_InitStructure);


    value = GPIO_ReadInputDataBit(IOPIN_DATA[pin].gpio, IOPIN_DATA[pin].pin) ? 1 : 0;
  } else jsError("Invalid pin!");
  return value;
}

