espruino/Espruino/targets/stm32/jshardware.c
JsVarFloat jshPinAnalog(int pin) {
  JsVarFloat value = 0;
  if (pin>=0 && pin < IOPINS && IOPIN_DATA[pin].gpio && IOPIN_DATA[pin].adc!=0xFF) {
    GPIO_InitTypeDef GPIO_InitStructure;
    GPIO_InitStructure.GPIO_Pin = IOPIN_DATA[pin].pin;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AIN;
#ifdef STM32F4    
    GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;    
#endif
    GPIO_Init(IOPIN_DATA[pin].gpio, &GPIO_InitStructure);

    // Configure chanel
#ifdef STM32F4    
    ADC_RegularChannelConfig(ADC1, IOPIN_DATA[pin].adc, 1, ADC_SampleTime_480Cycles);
#else
    ADC_RegularChannelConfig(ADC1, IOPIN_DATA[pin].adc, 1, ADC_SampleTime_239Cycles5/*ADC_SampleTime_55Cycles5*/);
#endif

    // Start the conversion
#ifdef STM32F4    
    ADC_SoftwareStartConv(ADC1);
#else
    ADC_SoftwareStartConvCmd(ADC1, ENABLE);
#endif

    // Wait until conversion completion
    while(ADC_GetFlagStatus(ADC1, ADC_FLAG_EOC) == RESET);

    // Get the conversion value
    value = ADC_GetConversionValue(ADC1) / (JsVarFloat)65535;
  } else jsError("Invalid analog pin!");
  return value;
}

static inline void jshSetPinValue(int pin, bool value) {
#ifdef STM32F4 
    if (value)
      GPIO_SetBits(IOPIN_DATA[pin].gpio, IOPIN_DATA[pin].pin);
    else
      GPIO_ResetBits(IOPIN_DATA[pin].gpio, IOPIN_DATA[pin].pin);
#else
    if (value)
      IOPIN_DATA[pin].gpio->BSRR = IOPIN_DATA[pin].pin;
    else
      IOPIN_DATA[pin].gpio->BRR = IOPIN_DATA[pin].pin;
#endif
}

void jshPinOutput(int pin, bool value) {
  if (pin>=0 && pin < IOPINS && IOPIN_DATA[pin].gpio) {
    GPIO_InitTypeDef GPIO_InitStructure;
    GPIO_InitStructure.GPIO_Pin = IOPIN_DATA[pin].pin;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
#ifdef STM32F4 
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
    GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
#else
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
#endif
    GPIO_Init(IOPIN_DATA[pin].gpio, &GPIO_InitStructure);

    jshSetPinValue(pin, value);
  } else jsError("Invalid pin!");
}

void jshPinAnalogOutput(int pin, JsVarFloat value) {
  if (value<0) value=0;
  if (value>1) value=1;
  if (pin>=0 && pin < IOPINS && IOPIN_DATA[pin].gpio && IOPIN_DATA[pin].timer!=TIMNONE) {
    TIM_TypeDef* TIMx;
#ifdef STM32F4
 #define STM32F4ONLY(X) X
    uint8_t afmap;
#else
 #define STM32F4ONLY(X)
#endif

    if (TIMER_TMR(IOPIN_DATA[pin].timer)==1) {
      TIMx = TIM1;
      STM32F4ONLY(afmap=GPIO_AF_TIM1);
      RCC_APB2PeriphClockCmd(RCC_APB2Periph_TIM1, ENABLE);  
    } else if (TIMER_TMR(IOPIN_DATA[pin].timer)==2)  {
      TIMx = TIM2;
      STM32F4ONLY(afmap=GPIO_AF_TIM2);
      RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2, ENABLE); 
    } else if (TIMER_TMR(IOPIN_DATA[pin].timer)==3)  {
      TIMx = TIM3;
      STM32F4ONLY(afmap=GPIO_AF_TIM3);
      RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM3, ENABLE);  
    } else if (TIMER_TMR(IOPIN_DATA[pin].timer)==4)  {
      TIMx = TIM4;
      STM32F4ONLY(afmap=GPIO_AF_TIM4);
      RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM4, ENABLE);  
    } else if (TIMER_TMR(IOPIN_DATA[pin].timer)==5) {
      TIMx = TIM5;
      STM32F4ONLY(afmap=GPIO_AF_TIM5);
       RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM5, ENABLE);  
/*    } else if (TIMER_TMR(IOPIN_DATA[pin].timer)==6)  { // Not used for outputs
      TIMx = TIM6;
      STM32F4ONLY(afmap=GPIO_AF_TIM6);
      RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM6, ENABLE);  
    } else if (TIMER_TMR(IOPIN_DATA[pin].timer)==7)  { // Not used for outputs
      TIMx = TIM7;
      STM32F4ONLY(afmap=GPIO_AF_TIM7);
      RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM7, ENABLE); */
    } else if (TIMER_TMR(IOPIN_DATA[pin].timer)==8) {
      TIMx = TIM8;
      STM32F4ONLY(afmap=GPIO_AF_TIM8);
      RCC_APB2PeriphClockCmd(RCC_APB2Periph_TIM8, ENABLE);  
    } else if (TIMER_TMR(IOPIN_DATA[pin].timer)==9)  {
      TIMx = TIM9;
      STM32F4ONLY(afmap=GPIO_AF_TIM9);
      RCC_APB2PeriphClockCmd(RCC_APB2Periph_TIM9, ENABLE);  
    } else if (TIMER_TMR(IOPIN_DATA[pin].timer)==10)  {
      TIMx = TIM10;
      STM32F4ONLY(afmap=GPIO_AF_TIM10);
      RCC_APB2PeriphClockCmd(RCC_APB2Periph_TIM10, ENABLE); 
    } else if (TIMER_TMR(IOPIN_DATA[pin].timer)==11)  {
      TIMx = TIM11;
      STM32F4ONLY(afmap=GPIO_AF_TIM11);
      RCC_APB2PeriphClockCmd(RCC_APB2Periph_TIM11, ENABLE); 
    } else if (TIMER_TMR(IOPIN_DATA[pin].timer)==12)  {
      TIMx = TIM12;
      STM32F4ONLY(afmap=GPIO_AF_TIM12);
      RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM12, ENABLE); 
    } else if (TIMER_TMR(IOPIN_DATA[pin].timer)==13)  {
      TIMx = TIM13;
      STM32F4ONLY(afmap=GPIO_AF_TIM13);
      RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM13, ENABLE); 
    } else if (TIMER_TMR(IOPIN_DATA[pin].timer)==14)  {
      TIMx = TIM14;
      STM32F4ONLY(afmap=GPIO_AF_TIM14);
      RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM14, ENABLE); 
    } else return; // eep!
    //   /* Compute the prescaler value */
  

  /* Time base configuration */
  TIM_TimeBaseInitTypeDef  TIM_TimeBaseStructure;
  TIM_TimeBaseStructInit(&TIM_TimeBaseStructure);
  TIM_TimeBaseStructure.TIM_Period = 0xFFFF;
//  PrescalerValue = (uint16_t) ((SystemCoreClock /2) / 28000000) - 1;
//  TIM_TimeBaseStructure.TIM_Prescaler = PrescalerValue;
  TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;
  TIM_TimeBaseInit(TIMx, &TIM_TimeBaseStructure);

  /* PWM1 Mode configuration*/
  TIM_OCInitTypeDef  TIM_OCInitStructure;
  TIM_OCStructInit(&TIM_OCInitStructure);
  TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_PWM1;
  TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
  TIM_OCInitStructure.TIM_Pulse = (uint32_t)(value*TIM_TimeBaseStructure.TIM_Period);
  TIM_OCInitStructure.TIM_OCPolarity = TIM_OCPolarity_High;

  if (TIMER_CH(IOPIN_DATA[pin].timer)==1) {
    TIM_OC1Init(TIMx, &TIM_OCInitStructure);
    TIM_OC1PreloadConfig(TIMx, TIM_OCPreload_Enable);
  } else if (TIMER_CH(IOPIN_DATA[pin].timer)==2) {
    TIM_OC2Init(TIMx, &TIM_OCInitStructure);
    TIM_OC2PreloadConfig(TIMx, TIM_OCPreload_Enable);
  } else if (TIMER_CH(IOPIN_DATA[pin].timer)==3) {
    TIM_OC3Init(TIMx, &TIM_OCInitStructure);
    TIM_OC3PreloadConfig(TIMx, TIM_OCPreload_Enable);
  } else if (TIMER_CH(IOPIN_DATA[pin].timer)==4) {
    TIM_OC4Init(TIMx, &TIM_OCInitStructure);
    TIM_OC4PreloadConfig(TIMx, TIM_OCPreload_Enable);
  }
  TIM_ARRPreloadConfig(TIMx, ENABLE); // ARR = Period. Not sure if we need preloads?

  // enable the timer
  TIM_Cmd(TIMx, ENABLE);

    GPIO_InitTypeDef GPIO_InitStructure;
    GPIO_InitStructure.GPIO_Pin = IOPIN_DATA[pin].pin;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
#ifdef STM32F4 
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
    GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
    GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP ; // required?
#else
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
#endif
    GPIO_Init(IOPIN_DATA[pin].gpio, &GPIO_InitStructure);
#ifdef STM32F4
    // connect timer pin up
    GPIO_PinAFConfig(IOPIN_DATA[pin].gpio, pinToPinSource(IOPIN_DATA[pin].pin), afmap);
#else
    if (TIMER_REMAP(IOPIN_DATA[pin].timer)) {
      if (TIMER_TMR(IOPIN_DATA[pin].timer)==1) GPIO_PinRemapConfig( GPIO_FullRemap_TIM1, ENABLE );
      else if (TIMER_TMR(IOPIN_DATA[pin].timer)==2) GPIO_PinRemapConfig( GPIO_FullRemap_TIM2, ENABLE );
      else if (TIMER_TMR(IOPIN_DATA[pin].timer)==3) GPIO_PinRemapConfig( GPIO_FullRemap_TIM3, ENABLE );
      else if (TIMER_TMR(IOPIN_DATA[pin].timer)==4) GPIO_PinRemapConfig( GPIO_Remap_TIM4, ENABLE );
      else if (TIMER_TMR(IOPIN_DATA[pin].timer)==15) GPIO_PinRemapConfig( GPIO_Remap_TIM15, ENABLE );
      else jsError("(internal) Remap needed, but unknown timer."); 
    }
#endif

  } else jsError("Invalid pin, or pin not capable of analog output!");
}

void jshPinPulse(int pin, bool value, JsVarFloat time) {
 JsSysTime ticks = jshGetTimeFromMilliseconds(time);
 //jsPrintInt(ticks);jsPrint("\n");
  if (pin>=0 && pin < IOPINS && IOPIN_DATA[pin].gpio) {
    GPIO_InitTypeDef GPIO_InitStructure;
    GPIO_InitStructure.GPIO_Pin = IOPIN_DATA[pin].pin;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
#ifdef STM32F4 
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
    GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
#else
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
#endif
    GPIO_Init(IOPIN_DATA[pin].gpio, &GPIO_InitStructure);


    jshSetPinValue(pin, value);
    JsSysTime starttime = jshGetSystemTime();
    JsSysTime endtime = starttime + ticks;
    //jsPrint("----------- ");jsPrintInt(endtime>>16);jsPrint("\n");
    JsSysTime stime = jshGetSystemTime();
    while (stime>=starttime && stime<endtime && !jspIsInterrupted()) { // this stops rollover issue
      stime = jshGetSystemTime();
      //jsPrintInt(stime>>16);jsPrint("\n");
    }
    jshSetPinValue(pin, !value);
  } else jsError("Invalid pin!");
}

void jshPinWatch(int pin, bool shouldWatch) {
  if (pin>=0 && pin < IOPINS && IOPIN_DATA[pin].gpio) {
    // TODO: check for DUPs, also disable interrupt
    int idx = pinToPinSource(IOPIN_DATA[pin].pin);
    /*if (pinInterrupt[idx].pin>PININTERRUPTS) jsError("Interrupt already used");
    pinInterrupt[idx].pin = pin;
    pinInterrupt[idx].fired = false;
    pinInterrupt[idx].callbacks = ...;*/

    // set as input
    GPIO_InitTypeDef GPIO_InitStructure;
    GPIO_InitStructure.GPIO_Pin = IOPIN_DATA[pin].pin;
#ifdef STM32F4    
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN;
    GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;    
#else
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
#endif
    GPIO_Init(IOPIN_DATA[pin].gpio, &GPIO_InitStructure);

