espruino/Espruino/targets/stm32/jshardware.c
#ifdef STM32F4 
    SYSCFG_EXTILineConfig(portToPortSource(IOPIN_DATA[pin].gpio), pinToPinSource(IOPIN_DATA[pin].pin));
#else
    GPIO_EXTILineConfig(portToPortSource(IOPIN_DATA[pin].gpio), pinToPinSource(IOPIN_DATA[pin].pin));
#endif

    EXTI_InitTypeDef s;
    EXTI_StructInit(&s);
    s.EXTI_Line = IOPIN_DATA[pin].pin; //EXTI_Line0
    s.EXTI_Mode =  EXTI_Mode_Interrupt;
    s.EXTI_Trigger = EXTI_Trigger_Rising_Falling;
    s.EXTI_LineCmd = ENABLE;
    EXTI_Init(&s);
  } else jsError("Invalid pin!");
}

bool jshIsEventForPin(IOEvent *event, int pin) {
  return IOEVENTFLAGS_GETTYPE(event->flags) == pinToEVEXTI(IOPIN_DATA[pin].pin);
}

USART_TypeDef* getUsartFromDevice(IOEventFlags device) {
 switch (device) {
   case EV_SERIAL1 : return USART1;
   case EV_SERIAL2 : return USART2;
   case EV_SERIAL3 : return USART3;
#if USARTS>=4
   case EV_SERIAL4 : return UART4;
#endif
#if USARTS>=5
   case EV_SERIAL5 : return UART5;
#endif
#if USARTS>=6
   case EV_SERIAL6 : return USART6;
#endif
   default: return 0;
 }
}

void jshUSARTSetup(IOEventFlags device, int baudRate) {
  uint16_t pinRX, pinTX;// eg. GPIO_Pin_1
  GPIO_TypeDef *gpioRX, *gpioTX;   // eg. GPIOA

  USART_TypeDef *usart = getUsartFromDevice(device);
  uint8_t usartIRQ;

  if (device == EV_SERIAL1) {
    usartIRQ = USART1_IRQn;
    gpioRX = USART1_PORT;
    gpioTX = USART1_PORT;
    pinRX = USART1_PIN_RX;
    pinTX = USART1_PIN_TX;
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1, ENABLE);
  } else if (device == EV_SERIAL2) {
    usartIRQ = USART2_IRQn;
    gpioRX = USART2_PORT;
    gpioTX = USART2_PORT;
    pinRX = USART2_PIN_RX;
    pinTX = USART2_PIN_TX;
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART2, ENABLE);
#if USARTS>= 3
  } else if (device == EV_SERIAL3) {
    usartIRQ = USART3_IRQn;
    gpioRX = USART3_PORT;
    gpioTX = USART3_PORT;
    pinRX = USART3_PIN_RX;
    pinTX = USART3_PIN_TX;
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART3, ENABLE);
#endif
#if USARTS>= 4
  } else if (device == EV_SERIAL4) {
    usartIRQ = UART4_IRQn;
    gpioRX = USART4_PORT;
    gpioTX = USART4_PORT;
    pinRX = USART4_PIN_RX;
    pinTX = USART4_PIN_TX;
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_UART4, ENABLE);
#endif
#if USARTS>= 5
  } else if (device == EV_SERIAL5) {
    usartIRQ = UART5_IRQn;
    gpioRX = USART5_PORT_RX;
    gpioTX = USART5_PORT_TX;
    pinRX = USART5_PIN_RX;
    pinTX = USART5_PIN_TX;
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_UART5, ENABLE);
#endif
#if USARTS>= 6
  } else if (device == EV_SERIAL6) {
    usartIRQ = USART6_IRQn;
    gpioRX = USART6_PORT;
    gpioTX = USART6_PORT;
    pinRX = USART6_PIN_RX;
    pinTX = USART6_PIN_TX;
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART6, ENABLE);
#endif
  } else {
    jsError("internal: Unknown serial port device.");
    return;
  }

  GPIO_InitTypeDef GPIO_InitStructure;
  GPIO_InitStructure.GPIO_Pin = pinRX;
#ifdef STM32F4
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
#else
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
#endif
  GPIO_Init(gpioRX, &GPIO_InitStructure);

  GPIO_InitStructure.GPIO_Pin = pinTX;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
#ifdef STM32F4
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF; // alternate fn
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStructure.GPIO_PuPd  = GPIO_PuPd_UP;
#else
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
#endif
  GPIO_Init(gpioTX, &GPIO_InitStructure);

  if (device == EV_SERIAL1) {
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1, ENABLE);
  } else if (device == EV_SERIAL2) {
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART2, ENABLE);
  }

#ifdef STM32F4
  if (device == EV_SERIAL1) {
    GPIO_PinAFConfig(gpioRX, pinToPinSource(pinRX), GPIO_AF_USART1);
    GPIO_PinAFConfig(gpioTX, pinToPinSource(pinTX), GPIO_AF_USART1);
  } else if (device == EV_SERIAL2) {
    GPIO_PinAFConfig(gpioRX, pinToPinSource(pinRX), GPIO_AF_USART2);
    GPIO_PinAFConfig(gpioTX, pinToPinSource(pinTX), GPIO_AF_USART2);
  } else if (device == EV_SERIAL3) {
    GPIO_PinAFConfig(gpioRX, pinToPinSource(pinRX), GPIO_AF_USART3);
    GPIO_PinAFConfig(gpioTX, pinToPinSource(pinTX), GPIO_AF_USART3);
  } else if (device == EV_SERIAL4) {
    GPIO_PinAFConfig(gpioRX, pinToPinSource(pinRX), GPIO_AF_UART4);
    GPIO_PinAFConfig(gpioTX, pinToPinSource(pinTX), GPIO_AF_UART4);
  } else if (device == EV_SERIAL5) {
    GPIO_PinAFConfig(gpioRX, pinToPinSource(pinRX), GPIO_AF_UART5);
    GPIO_PinAFConfig(gpioTX, pinToPinSource(pinTX), GPIO_AF_UART5);
  } else if (device == EV_SERIAL6) {
    GPIO_PinAFConfig(gpioRX, pinToPinSource(pinRX), GPIO_AF_USART6);
    GPIO_PinAFConfig(gpioTX, pinToPinSource(pinTX), GPIO_AF_USART6);
  }
#endif

  USART_ClockInitTypeDef USART_ClockInitStructure;
  USART_ClockStructInit(&USART_ClockInitStructure);
  USART_ClockInit(usart, &USART_ClockInitStructure);

  USART_InitTypeDef USART_InitStructure;
  USART_InitStructure.USART_BaudRate = baudRate;
  USART_InitStructure.USART_WordLength = USART_WordLength_8b;
  USART_InitStructure.USART_StopBits = USART_StopBits_1;
  USART_InitStructure.USART_Parity = USART_Parity_No ;
  USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;
  USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
  USART_Init(usart, &USART_InitStructure);

  // enable uart interrupt
  NVIC_InitTypeDef NVIC_InitStructure;
  NVIC_InitStructure.NVIC_IRQChannel = usartIRQ;
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init( &NVIC_InitStructure );
  // Enable RX interrupt (TX is done when we have bytes)
  USART_ClearITPendingBit(usart, USART_IT_RXNE);
  USART_ITConfig(usart, USART_IT_RXNE, ENABLE);
  //Enable USART
  USART_Cmd(usart, ENABLE);
}

/** Kick a device into action (if required). For instance we may need
 * to set up interrupts */
void jshUSARTKick(IOEventFlags device) {
  USART_TypeDef *uart = getUsartFromDevice(device);
    if (uart) USART_ITConfig(uart, USART_IT_TXE, ENABLE);
}


void jshSaveToFlash() {
#ifdef STM32F4 
  FLASH_Unlock();
#else
  FLASH_UnlockBank1();
#endif

